InformationRegisters/ИА_ПодписиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ПодписиСотрудников</Name>
			<Comment>Образцы подписей сотрудников</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_НастройкиЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_НастройкиЗначения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ИА_НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ИА_НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КСУ_ВидОргсхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КСУ_ВидОргсхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>VC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ВариантыОформленияДепартаментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ВариантыОформленияДепартаментов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СлитноСОтделами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдельно</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ИА_ТипыДиаграммыВЭксель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИА_ТипыДиаграммыВЭксель</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СОбластями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Графики</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ИА_Инструкции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_Инструкции</Name>
			<Comment>Должностные инструкции</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипИнструкции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ТипыИнструкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Теги</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеИнструкции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_СтатусИнструкции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКолонтитула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВремКаталогаВорд</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновленияГугл</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаГуглДок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодРаспределения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсемСотрудникам</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Серии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Серии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокТегов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВерсииДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаСоздания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Файл</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Вопросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/КСУ_Настройки_УПР/Ext/Form/Module.bsl
&НаКлиенте
Перем мРасписание;

&НаКлиенте
Перем РасписаниеОповещений;

&НаКлиенте
Процедура Оргсхема_ЗаполнитьПоУмолчанию(Команда)
	НаборКонстант.ИА_ВысотаПодписиВБлокеСекцияИСотрудник = 10;
	НаборКонстант.РасстояниеМеждуБлокамиГоризонтальное = 2;
	НаборКонстант.РасстояниеМеждуБлокамиВертикальное = 8;
	НаборКонстант.РасстояниеМеждуСекциями = 0;
	НаборКонстант.ПоднятиеСекции = 3;
	ПолеШрифт = Новый Шрифт("Times New Roman",10 , истина, Истина);
	
	Если НаборКонстант.КСУ_ВидОргсхемы = ПредопределенноеЗначение("Перечисление.КСУ_ВидОргсхемы.EM") Тогда
		НаборКонстант.ИА_ВариантыОформленияДепартаментов = ПредопределенноеЗначение("Перечисление.ИА_ВариантыОформленияДепартаментов.Отдельно");
	Иначе
		НаборКонстант.ИА_ВариантыОформленияДепартаментов = ПредопределенноеЗначение("Перечисление.ИА_ВариантыОформленияДепартаментов.СлитноСОтделами");
	КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#ЕСЛИ ВебКлиент ТОГДА
		Элементы.РасширениеРаботыСФайлами.Видимость = истина;
		ПодключитьРасширениеРаботыСФайлами();
	#КОНЕЦЕСЛИ
	
	Если ЕстьПравоАдминистрирование Тогда
		
		мРасписание = ПолучитьРасписание();
		
		Если  мРасписание<> Неопределено Тогда
			УстановитьТекстНадписиРегламентнойНастройки();
			Авторасчет = ПолучитьАвторасчет();
		КонецЕсли;   	
		
		РасписаниеОповещений = ПолучитьРасписаниеОповещений();
		Если РасписаниеОповещений <> Неопределено Тогда
			ИспользоватьОповещения = ПолучитьИспользованиеОповещений();
		КонецЕсли;
	КонецЕсли;
	
	ВидимостьЭлементовНастройкиЗаполненияРеквизитов();
	ОбновитьДоступностьДоходыПоПодр();
	ВидимостьНастроекДИ();
	
	ЗаблокироватьПоля(Неопределено);
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписаниеОповещений()
	Попытка
		рез = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ИА_ОповещениеОНезаполненныхСтатистиках);
		рез = рез.Расписание;
	Исключение
		Рез = Неопределено;
	КонецПопытки;	
	
	Возврат Рез;
КонецФункции

&НаСервере
Функция ПолучитьИспользованиеОповещений()
	Попытка
		рез = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ИА_ОповещениеОНезаполненныхСтатистиках);
		рез = рез.Использование;
	Исключение
		Рез = Ложь;
	КонецПопытки;	
	
	Возврат Рез;

КонецФункции



&НаКлиенте
Процедура УстановитьТекстНадписиРегламентнойНастройки()
	
	Перем ТекстЗаголовка, ТекстРасписания, РасписаниеАктивно;
	
	ПолучитьТекстЗаголовкаИРасписанияРегламентнойНастройки(Авторасчет, мРасписание, ТекстЗаголовка, ТекстРасписания, РасписаниеАктивно);
	Элементы.НадписьРасписаниеРегламентногоЗаданияНастройки.Заголовок = ТекстРасписания;
    	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	текШрифт = Константы.ИА_ШрифтПодписиСотрудника.Получить().Получить();
	
	Если текШрифт <> Неопределено Тогда
		ПолеШрифт = Новый Шрифт(текШрифт);
	КонецЕсли;
	
	// Версия КСУ
	Макет = ПолучитьОбщийМакет("КСУ_ВерсияРелиза");
	НомерРелиза = Макет.ПолучитьСтроку(1);
	ЭтаФорма.Заголовок = "Настройки КСУ (релиз "+НомерРелиза+")";
    
    Если НЕ ИА_БФКС.РеквизитЕсть(Метаданные.БизнесПроцессы, "ИА_БПНоситель") Тогда
    	Элементы.ГруппаНФ.Видимость = Ложь;
    КонецЕсли; 
	
	ПолучитьНастройкиЗаполненияРеквизитовНаСервере();
	//Элементы.ИА_ФП_ИспользоватьВидДССправочно.Доступность = Не НаборКонстант.ИА_ФП_РазделятьНалИБезнал; 

	ЕстьПравоАдминистрирование = ПравоДоступа("Администрирование", Метаданные);
	
	// логотип
	уид1 = новый УникальныйИдентификатор;
	Попытка
		логоДанные = Константы.ИА_ЛоготипКомпании.Получить();
		Если ЗначениеЗаполнено(логоДанные) Тогда
			дд = логоДанные.Получить();
			АдресКартинкиЛоготип = ПоместитьВоВременноеХранилище(дд,уид1);
		КонецЕсли;
	Исключение
	КонецПопытки;

	//ИА_КСУОбщийСервер.СделатьКнопкуОсновной(Элементы.ГруппаКП);
	
	Элементы.ИА_ВариантыОформленияДепартаментов.Доступность = НаборКонстант.КСУ_ВидОргсхемы <> Перечисления.КСУ_ВидОргсхемы.EM;
	
	Попытка
		а = Константы.КСУ_ДатаПоследнегоОбмена1с_Веб.Получить();
	Исключение
		Элементы.НастройкиВебСистемы.Видимость = ложь;
	КонецПопытки;
	
	ЕстьПодразделения = Ложь;
	Если Метаданные.Справочники.Найти("Подразделения")<> Неопределено тогда
		ЕстьПодразделения = Истина;
	ИначеЕсли Метаданные.Справочники.Найти("СтруктурныеЕдиницы")<> Неопределено тогда
		ЕстьПодразделения = Истина;
	ИначеЕсли Метаданные.Справочники.Найти("СтруктураПредприятия")<> Неопределено тогда
		ЕстьПодразделения = Истина;
	КонецЕсли;
	ЕстьДДС = Ложь;
	Если Метаданные.Справочники.Найти("СтатьиДвиженияДенежныхСредств") <> Неопределено Тогда
		ЕстьДДС = Истина;
	КонецЕсли;
	
	Элементы.КСУ_СинхронизацияСтатейИПодразделений.Видимость = ЕстьПодразделения И ЕстьДДС;
	Элементы.ГруппаСинхр.Видимость = ЕстьПодразделения И ЕстьДДС;
	
	Если НЕ ИА_Защита_Общий.ЛицензияДоступна("НФ",,истина) Тогда 
		Элементы.Группа_НФ.Доступность = ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Страница") Тогда
		Элементы.ГруппаГлавная.ТекущаяСтраница = Элементы[Параметры.Страница];
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьРасписание()
	Попытка
		рез = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.КСУ_ПересчетКубов);
		рез = рез.Расписание;
	Исключение
		Рез = Неопределено;
	КонецПопытки;	
	
	Возврат Рез;
КонецФункции

&НаСервере
Функция ПолучитьАвторасчет()
	Попытка
		рез = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.КСУ_ПересчетКубов);
		рез = рез.Использование;
	Исключение
		Рез = Ложь;
	КонецПопытки;	
	
	Возврат Рез;
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьРасписание(знач пРасписание)
	Попытка
		мРегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.КСУ_ПересчетКубов);
		мРегламентноеЗадание.Расписание = пРасписание;
		мРегламентноеЗадание.Записать();
	Исключение
		ВызватьИсключение "Произошла ошибка при сохранении расписания. Возможно данные расписания были изменены. Закройте форму настройки и повторите попытку изменения расписания еще раз.
		|Подробное описание ошибки: " + ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьРасписаниеОповещений(Знач пРасписание)
	Попытка
		мРегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ИА_ОповещениеОНезаполненныхСтатистиках);
		мРегламентноеЗадание.Расписание = пРасписание;
		мРегламентноеЗадание.Записать();
	Исключение
		ВызватьИсключение "Произошла ошибка при сохранении расписания. Возможно данные расписания были изменены. Закройте форму настройки и повторите попытку изменения расписания еще раз.
		|Подробное описание ошибки: " + ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры


&НаСервере
Процедура УстановитьИспользование(Авторасчет)
	Попытка
		мРегламентноеЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.КСУ_ПересчетКубов);
		мРегламентноеЗадание.Использование = Авторасчет;
		мРегламентноеЗадание.Записать();
	Исключение
		ВызватьИсключение "Произошла ошибка при сохранении расписания. Возможно данные расписания были изменены. Закройте форму настройки и повторите попытку изменения расписания еще раз.
		|Подробное описание ошибки: " + ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура НадписьРасписаниеРегламентногоЗаданияНастройкиНажатие(Элемент)
	Если мРасписание = Неопределено Тогда
		Возврат
	КонецЕсли;
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(мРасписание);
		
	Диалог.Показать(Новый ОписаниеОповещения("НадписьРасписаниеРегламентногоЗаданияНастройкиНажатиеЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасписаниеРегламентногоЗаданияНастройкиНажатиеЗавершение(Расписание1, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	
	Если Расписание1<>Неопределено Тогда
		
		//РаспВр = Новый РасписаниеРегламентногоЗадания(Диалог.Расписание);
		УстановитьРасписание(Расписание1);
		
	КонецЕсли;
	
	УстановитьТекстНадписиРегламентнойНастройки();

КонецПроцедуры

&НаКлиенте
Процедура АвторасчетПриИзменении(Элемент)
	Если мРасписание = Неопределено Тогда
		Возврат
	КонецЕсли;
	УстановитьИспользование(Авторасчет);
	УстановитьТекстНадписиРегламентнойНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекстЗаголовкаИРасписанияРегламентнойНастройки(Использование,Расписание, ТекстЗаголовка, ТекстРасписания, РасписаниеАктивно) Экспорт
	
	РасписаниеАктивно = Ложь;
	
	ТекстЗаголовка = "Дополнительные настройки расписания ...";
	
	Если Расписание = Неопределено Тогда
		
		//ТекстЗаголовка = "Создать регламентную настройку ...";	
		ТекстРасписания = "<Расписание не задано>";
		
	Иначе
		
		//ТекстЗаголовка = "Дополнительные настройки расписания ...";
		Если Использование Тогда
			ПрефиксРасписания = "Расписание: ";
			РасписаниеАктивно = Истина;
		Иначе
			ПрефиксРасписания = "Расписание (НЕ АКТИВНО): ";
		КонецЕсли;
		
		ТекстРасписания = ПрефиксРасписания + Строка(Расписание);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписиСотрудников(Команда)
	ОткрытьФорму("РегистрСведений.ИА_ПодписиСотрудников.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПослеЗаписиНаСервере();
	
	Если (ШрифтИзменен или ВысотаПодписиИзменена или СпособВыводаФИОИзменен) Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗаписиЗавершение", ЭтотОбъект), "Изменен шрифт или высота подписи сотрудников или способ представления ФИО. Пересчитать автоматически высоту блоков?", РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	ПослеЗаписиФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		ПересчитатьВысотуОргсхема();
	КонецЕсли;
	
	ПослеЗаписиФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиФрагмент()
	
	Если ДоступДИИзменен Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗаписиФрагментЗавершение", ЭтотОбъект), "Изменены настройки доступа к должностным инструкциям. Для вступления в силу изменений необходимо выполнить процедуру обновления доступа (это может занять несколько минут). Продолжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписиФрагментЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да Тогда
		ПерезаписатьДИ();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПерезаписатьДИ()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_Инструкции.Ссылка
	               |ИЗ
	               |	Справочник.ИА_Инструкции КАК ИА_Инструкции
	               |ГДЕ
	               |	ИА_Инструкции.ЭтоГруппа = ложь
	               |	И ИА_Инструкции.ПометкаУдаления = ложь";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		об = Выборка.Ссылка.Получитьобъект();
		об.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьВысотуОргсхема()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОргСхема.Ссылка,
	               |	0 КАК Уровень
	               |ИЗ
	               |	Справочник.ОргСхема КАК ОргСхема
	               |ГДЕ
	               |	ОргСхема.ПометкаУдаления = ЛОЖЬ";
	ТЗ = Запрос.Выполнить().Выгрузить();

	Для каждого стр из ТЗ Цикл
		стр.Уровень = Стр.Ссылка.Уровень();
	КонецЦикла;
	ТЗ.Сортировать("Уровень УБЫВ");
	
	Для каждого стр из ТЗ Цикл
		о = стр.Ссылка.ПолучитьОбъект();
		о.Записать();
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере()
	
	Константы.ИА_ШрифтПодписиСотрудника.Установить(Новый ХранилищеЗначения(ПолеШрифт));
	
	СохранитьНастройкиЗаполненияРеквизитовНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеШрифтПриИзменении(Элемент)
	Модифицированность = истина;
	ШрифтИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИА_ВысотаПодписиВБлокеСекцияИСотрудникПриИзменении(Элемент)
	ВысотаПодписиИзменена = истина;
КонецПроцедуры

&НаКлиенте
Процедура ИА_ПечатьСтатистикВЭксельПриИзменении(Элемент)
	Если НаборКонстант.ИА_ПечатьСтатистикВЭксель И Не ЗначениеЗаполнено(НаборКонстант.ИА_ТипДиаграммыВЭксель) Тогда
		НаборКонстант.ИА_ТипДиаграммыВЭксель = ПредопределенноеЗначение("Перечисление.ИА_ТипыДиаграммыВЭксель.Графики");
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НаборКонстант.ИА_ПечатьСтатистикВЭксель И Не ЗначениеЗаполнено(НаборКонстант.ИА_ТипДиаграммыВЭксель) Тогда
		Сообщить("Не выбран тип диаграммы в эксель!");
		Отказ = Истина;
	КонецЕсли;
	
	Если НаборКонстант.КСУ_СинхронизацияСтатейИПодразделений И Не ЗначениеЗаполнено(НаборКонстант.КСУ_ФондДляНовыхСтатей) Тогда
		Сообщить("Укажите фонд для новых статей!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогХраненияФайловНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	КаталогХранения = НаборКонстант["ИА_"+Элемент.Имя];	
	
	ВыборКаталогаДляХранения(КаталогХранения);
	
    НаборКонстант["ИА_"+Элемент.Имя] = КаталогХранения;
	
КонецПроцедуры



&НаКлиенте
Процедура ВыборКаталогаДляХранения(КаталогХранения)
	
  ОчиститьСообщения();	
  СтароеЗначениеКаталога = КаталогХранения;
	
  Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
  ДиалогВыбораКаталога= Новый ДиалогВыбораФайла(Режим);
  ДиалогВыбораКаталога.Каталог = КаталогХранения;
  
  Если ДиалогВыбораКаталога.Выбрать() Тогда
	  
	 КаталогХранения = ДиалогВыбораКаталога.Каталог+"\";
	 
	 Попытка
		 ПроверкаПравНаЗаписи = Новый ТекстовыйДокумент;
		 ПроверкаПравНаЗаписи.Записать(КаталогХранения+"Test.txt");
		 УбратьФайл = Новый Файл(КаталогХранения+"Test.txt");
		 Если УбратьФайл.Существует() Тогда
			 УдалитьФайлы(КаталогХранения+"Test.txt");
		 КонецЕсли;
	 Исключение      
		 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "У вас нет прав для записи в каталог : "+КаталогХранения +" !" ;
		Сообщение.Сообщить(); 
		
		КаталогХранения = СтароеЗначениеКаталога;
		
	 КонецПопытки;
	Иначе
	  
	 КаталогХранения = "";
	  
  КонецЕсли;  
  
  
    
КонецПроцедуры



&НаСервере
Функция ПолучитьТекПользователя()
	
КонецФункции
 

&НаКлиенте
Процедура ПраваПользователей(Команда)
    //П = Новый Структура("Пользователь", ИА_КСУОбщийСервер.ТекущийПользователь());
    //ОткрытьФорму("РегистрСведений.ИА_ПраваЗначения.Форма.ФормаРедактор", П);
	ОткрытьФорму("ОбщаяФорма.КСУ_ДополнительныеПраваДляПользователейКСУ");
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПользователей(Команда)
   П = Новый Структура("Пользователь", ИА_КСУОбщийСервер.ТекущийПользователь());
   ОткрытьФорму("РегистрСведений.ИА_НастройкиЗначения.Форма.ФормаРедактор", П);
КонецПроцедуры

&НаКлиенте
Процедура ИА_ДИ_КонтрольПоТипамИнструкцийПриИзменении(Элемент)
	ДоступДИИзменен = истина;
КонецПроцедуры

&НаКлиенте
Процедура ИА_ДИ_КонтрольПоСериямПриИзменении(Элемент)
	ДоступДИИзменен = истина;
КонецПроцедуры

&НаКлиенте
Процедура ИА_ДИ_КонтрольПоСтатусамПриИзменении(Элемент)
	ДоступДИИзменен = истина;
КонецПроцедуры

&НаКлиенте
Процедура ИА_СпособВыводаФИОДляОргсехмыПриИзменении(Элемент)
	СпособВыводаФИОИзменен = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасписаниеРегламентногоЗаданияПоОповещениямНажатие(Элемент)
	Диалог = Новый ДиалогРасписанияРегламентногоЗадания(РасписаниеОповещений);
		
	Диалог.Показать(Новый ОписаниеОповещения("НадписьРасписаниеРегламентногоЗаданияПоОповещениямНажатиеЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьРасписаниеРегламентногоЗаданияПоОповещениямНажатиеЗавершение(Расписание1, ДополнительныеПараметры) Экспорт
	
	Диалог = ДополнительныеПараметры.Диалог;
	
	
	Если Расписание1<>Неопределено Тогда
		УстановитьРасписаниеОповещений(Расписание1);	
		РасписаниеОповещений = Расписание1;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОповещенияПриИзменении(Элемент)
	ИспользоватьОповещенияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспользоватьОповещенияПриИзмененииНаСервере()
	Попытка
		РегЗ = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.ИА_ОповещениеОНезаполненныхСтатистиках);
		РегЗ.Использование = ИспользоватьОповещения;
		РегЗ.Записать();
	Исключение
		ВызватьИсключение "Произошла ошибка при сохранении расписания. Возможно данные расписания были изменены. Закройте форму настройки и повторите попытку изменения расписания еще раз.
		|Подробное описание ошибки: " + ОписаниеОшибки();
	КонецПопытки;

КонецПроцедуры

&НаСервере
Процедура ДИ_ЗаполнитьКэшНаСервере()
    Таб = ИА_БФС.Запрос_ВыполнитьВТЗ(
    #Область ТекстЗапроса
    "ВЫБРАТЬ
    |	ИА_Инструкции.Ссылка
    |ИЗ
    |	Справочник.ИА_Инструкции КАК ИА_Инструкции
    |ГДЕ
    |	НЕ ИА_Инструкции.ЭтоГруппа
    |	И НЕ ИА_Инструкции.ПометкаУдаления"
    #КонецОбласти 
    , Новый Структура("", )); 
    
    
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "К обработке: " + Таб.Количество() + " инструкций";
    Сообщение.Сообщить(); 
    Для каждого Стр Из Таб Цикл
        ИА_БФС.КэшСтр_Удалить(, Стр.Ссылка);
    	НовТекст = ИА_ОбщиеПроцедуры_Технология_Сервер.ПолучитьПредставлениеИнструкции(Стр.Ссылка);
    КонецЦикла;  
    Сообщение = Новый СообщениеПользователю;
    Сообщение.Текст = "Кэш инструкций сформирован";
    Сообщение.Сообщить(); 
КонецПроцедуры

&НаКлиенте
Процедура ДИ_ЗаполнитьКэш(Команда)
    ДИ_ЗаполнитьКэшНаСервере();
КонецПроцедуры


//Арчил Тваладзе 2016.04.26
&НаКлиенте
Процедура ОтрытьФормуСпискаДанныеФизЛиц(Команда)
	
	Форма = ПолучитьФорму("РегистрСведений.ИА_ДанныеФизЛиц.ФормаСписка",,ЭтаФорма);	
	Форма.Открыть();
	
КонецПроцедуры
//Конец Арчил Тваладзе

//Арчил Тваладзе 20.04.2016
#Область НастройкиЗаполненияРеквизитов

#Область ОбработчикиСобытий
&НаКлиенте
Процедура ТипРегистраДенежныеСредстваПриИзменении(Элемент)
	ВидимостьЭлементовНастройкиЗаполненияРеквизитов()
КонецПроцедуры

&НаКлиенте
Процедура КоличествоРегистровДенежныеСредстваПриИзменении(Элемент)
	
	ВидимостьЭлементовНастройкиЗаполненияРеквизитов();
	ЗаполнитьСпискиВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяРегистраДенежныеСредстваПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораИмяИзмеренияТипДенежныхСредств();
	ЗаполнитьСписокВыбораИмяРесурсаСуммаУпр();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяИзмеренияТипДенежныхСредствПриИзменении(Элемент)
	
	ИмяИзмеренияТипДенежныхСредствПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяРегистраДенежныеСредстваНаличныеПриИзменении(Элемент)
	ЗаполнитьСписокВыбораИмяРесурсаСуммаУпрНаличные();
КонецПроцедуры

&НаКлиенте
Процедура ИмяРегистраДенежныеСредстваБезНаличныеПриИзменении(Элемент)
	ЗаполнитьСписокВыбораИмяРесурсаСуммаУпрБезНаличные();
КонецПроцедуры


&НаСервере
Процедура ИмяИзмеренияТипДенежныхСредствПриИзмененииНаСервере()
	
	Перем СсылкаНаТип, ТипИзмеренияТипДенежныхСредств;
	
	ТипИзмеренияТипДенежныхСредств = Метаданные.РегистрыНакопления[ИмяРегистраДенежныеСредства].Измерения[ИмяИзмеренияТипДенежныхСредств].Тип.Типы()[0];
	СсылкаНаТип = Новый(ТипИзмеренияТипДенежныхСредств);
	
	ИмяПеречисленияТипДенежныхСредств = СсылкаНаТип.Метаданные().Имя;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораИмяРегистраДенежныеСредства()
	ЗаполнитьСписокВыбораПоСпискуРегистровНакопления(Элементы.ИмяРегистраДенежныеСредства);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораИмяРегистраДенежныеСредстваНаличные()
	ЗаполнитьСписокВыбораПоСпискуРегистровНакопления(Элементы.ИмяРегистраДенежныеСредстваНаличные);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораИмяРегистраДенежныеСредстваБезНаличные()
	ЗаполнитьСписокВыбораПоСпискуРегистровНакопления(Элементы.ИмяРегистраДенежныеСредстваБезНаличные);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораИмяИзмеренияТипДенежныхСредств()
	ЗаполнитьСписокВыбораПоСпискуИзмеренийРегистраНакопления(ИмяРегистраДенежныеСредства, Элементы.ИмяИзмеренияТипДенежныхСредств)
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораИмяРесурсаСуммаУпр()
	ЗаполнитьСписокВыбораПоСпискуРесурсовРегистраНакопления(ИмяРегистраДенежныеСредства, Элементы.ИмяРесурсаСуммаУпр)
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораИмяРесурсаСуммаУпрНаличные()
	ЗаполнитьСписокВыбораПоСпискуРесурсовРегистраНакопления(ИмяРегистраДенежныеСредстваНаличные, Элементы.ИмяРесурсаСуммаУпрНаличные)
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораИмяРесурсаСуммаУпрБезНаличные()
	ЗаполнитьСписокВыбораПоСпискуРесурсовРегистраНакопления(ИмяРегистраДенежныеСредстваБезНаличные, Элементы.ИмяРесурсаСуммаУпрБезНаличные)
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоСпискуРегистровНакопления(Элемент)
	
	Элемент.СписокВыбора.Очистить();
	Для каждого МетаданныеРН Из Метаданные.РегистрыНакопления Цикл
	  	Элемент.СписокВыбора.Добавить(МетаданныеРН.Имя, МетаданныеРН.Синоним);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоСпискуИзмеренийРегистраНакопления(ИмяРегистра, Элемент)
	
	Элемент.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(ИмяРегистра) и Метаданные.РегистрыНакопления.Найти(ИмяРегистра)<>Неопределено Тогда
		Для каждого РеквизитРН Из Метаданные.РегистрыНакопления[ИмяРегистра].Измерения Цикл
			Элемент.СписокВыбора.Добавить(РеквизитРН.Имя, РеквизитРН.Синоним);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораПоСпискуРесурсовРегистраНакопления(ИмяРегистра, Элемент)
	
	Элемент.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(ИмяРегистра) И Метаданные.РегистрыНакопления.Найти(ИмяРегистра)<>Неопределено Тогда
		Для каждого РеквизитРН Из Метаданные.РегистрыНакопления[ИмяРегистра].Ресурсы Цикл
			Элемент.СписокВыбора.Добавить(РеквизитРН.Имя, РеквизитРН.Синоним);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область КомандыМеню
&НаКлиенте
Процедура ЗаполнитьПоКА1_1(Команда)
	ЗаполнитьНастройкиЗаполненияРеквизитовПоШаблону("КА");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУТ11_1(Команда)
	ЗаполнитьНастройкиЗаполненияРеквизитовПоШаблону("УТ");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоБП3_0(Команда)
	ЗаполнитьНастройкиЗаполненияРеквизитовПоШаблону("БП");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоУНФ(Команда)
	ЗаполнитьНастройкиЗаполненияРеквизитовПоШаблону("УНФ");
КонецПроцедуры//конец Арчил Тваладзе 20.04.2016

&НаКлиенте
Процедура ЗаполнитьНастройкиЗаполненияРеквизитовПоШаблону(Конф)
	
	Если Конф ="КА" Тогда
		
		ИмяРеквизитаВалютаУПР       = "ВалютаРегламентированногоУчета";
		ИмяРеквизитаВалютаДокумента = "ВалютаДокумента";
		
		ИмяРеквизитаРасшифровкаПлатежаСумма    = "СуммаПлатежа";
		ПересчитатьСуммуНДСВРасшифровкеПлатежа = Истина;
		
        НаборКонстант.ИА_ПроизводственныйКалендарьИмяРегистра   = "РегламентированныйПроизводственныйКалендарь";
        НаборКонстант.ИА_ПроизводственныйКалендарьИзмерениеДата = "ДатаКалендаря";
		
		ТипРегистраДенежныеСредства    = "РегистрНакопления";
		
		КоличествоРегистровДенежныеСредства    = 1;
		ИмяРегистраДенежныеСредства ="ДенежныеСредства";
		
		ИмяИзмеренияТипДенежныхСредств = "ВидДенежныхСредств";
		ИмяПеречисленияТипДенежныхСредств = "ВидыДенежныхСредств";
		ИмяРесурсаСуммаУпр = "СуммаУпр";
		
	ИначеЕсли Конф ="БП" Тогда
		
		ИмяРеквизитаВалютаУПР       = "ВалютаРегламентированногоУчета";
		ИмяРеквизитаВалютаДокумента = "ВалютаДокумента";
		
		ИмяРеквизитаРасшифровкаПлатежаСумма    = "СуммаПлатежа";
		ПересчитатьСуммуНДСВРасшифровкеПлатежа = Истина;
		
        НаборКонстант.ИА_ПроизводственныйКалендарьИмяРегистра   = "ДанныеПроизводственногоКалендаря";
        НаборКонстант.ИА_ПроизводственныйКалендарьИзмерениеДата = "Дата";
		
		ТипРегистраДенежныеСредства    = "РегистрБухгалтерии";
		
		ИмяРегистраБухгалтерии    = "Хозрасчетный";
	
	ИначеЕсли Конф ="УТ" Тогда

		ИмяРеквизитаВалютаУПР       = "ВалютаРегламентированногоУчета";
		ИмяРеквизитаВалютаДокумента = "Валюта";
		
		ИмяРеквизитаРасшифровкаПлатежаСумма    = "Сумма";
		ПересчитатьСуммуНДСВРасшифровкеПлатежа = Ложь;
		
        НаборКонстант.ИА_ПроизводственныйКалендарьИмяРегистра   = "ДанныеПроизводственногоКалендаря";
        НаборКонстант.ИА_ПроизводственныйКалендарьИзмерениеДата = "Дата";
		
		ТипРегистраДенежныеСредства         = "РегистрНакопления";
		
		ИмяРегистраДенежныеСредстваНаличные    = "ДенежныеСредстваНаличные";
		ИмяРегистраДенежныеСредстваБезНаличные = "ДенежныеСредстваБезНаличные";

		КоличествоРегистровДенежныеСредства    = 2;
		
		ИмяРесурсаСуммаУпрНаличные    = "СуммаУпр";
		ИмяРесурсаСуммаУпрБезНаличные = "СуммаУпр";

	ИначеЕсли Конф ="УНФ" Тогда

		ИмяРеквизитаВалютаУПР       = "ВалютаУчета";
		ИмяРеквизитаВалютаДокумента = "ВалютаДенежныхСредств";
		
		ИмяРеквизитаРасшифровкаПлатежаСумма    = "СуммаПлатежа";
		ПересчитатьСуммуНДСВРасшифровкеПлатежа = Истина;
		
        НаборКонстант.ИА_ПроизводственныйКалендарьИмяРегистра   = "ДанныеПроизводственногоКалендаря";
        НаборКонстант.ИА_ПроизводственныйКалендарьИзмерениеДата = "Дата";
		
		ТипРегистраДенежныеСредства    = "РегистрНакопления";
		
		КоличествоРегистровДенежныеСредства    = 1;
		
		ИмяРегистраДенежныеСредства = "ДенежныеСредства";

		ИмяИзмеренияТипДенежныхСредств    = "ТипДенежныхСредств";
		ИмяПеречисленияТипДенежныхСредств ="ТипыДенежныхСредств";
		
		ИмяРесурсаСуммаУпр = "Сумма";

	КонецЕсли;
	
	ВидимостьЭлементовНастройкиЗаполненияРеквизитов();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьБазуЗнанийПЗП(Команда)
	
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ТолькоПросмотр", Ложь);
	//ОткрытьФорму("ОбщаяФорма.ИА_ФП_БазаЗнанийПЗП", ПараметрыФормы);
	
	ОткрытьФорму("Справочник.КСУ_ИнструкцииКЗаказам.ФормаСписка");
КонецПроцедуры
#КонецОбласти

#Область ИнициализацияФормы
&НаСервере
Процедура ЗаполнитьСпискиВыбора()
	
	ЗаполнитьСписокВыбораИмяРегистраДенежныеСредства();
	ЗаполнитьСписокВыбораИмяРегистраДенежныеСредстваНаличные();
	ЗаполнитьСписокВыбораИмяРегистраДенежныеСредстваБезНаличные();
	ЗаполнитьСписокВыбораИмяИзмеренияТипДенежныхСредств();
	ЗаполнитьСписокВыбораИмяРесурсаСуммаУпр();
	ЗаполнитьСписокВыбораИмяРесурсаСуммаУпрНаличные();
	ЗаполнитьСписокВыбораИмяРесурсаСуммаУпрБезНаличные();

КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовНастройкиЗаполненияРеквизитов()

	Если ТипРегистраДенежныеСредства = "РегистрНакопления" Тогда
		
		Элементы.ГруппаТипРегистраДСНакопления.Видимость    = Истина;
		Элементы.ГруппаТипРегистраДСБухгалтерский.Видимость = Ложь;
		
		Если КоличествоРегистровДенежныеСредства = 2 Тогда
			Элементы.Группа1РегистрДС.Видимость = Ложь;
			Элементы.Группа2РегистрДС.Видимость = Истина;
		Иначе
			Элементы.Группа1РегистрДС.Видимость = Истина;
			Элементы.Группа2РегистрДС.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипРегистраДенежныеСредства = "РегистрБухгалтерии" Тогда
		
		Элементы.ГруппаТипРегистраДСНакопления.Видимость    = Ложь;
		Элементы.ГруппаТипРегистраДСБухгалтерский.Видимость = Истина;
		
		Элементы.Группа1РегистрДС.Видимость = Ложь;
		Элементы.Группа2РегистрДС.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.Группа1.Видимость = ЕстьПравоАдминистрирование;

КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиЗаполненияРеквизитовНаСервере()
	
	СохраняемоеЗначение = Новый Структура;
	
	СохраняемоеЗначение.Вставить("ИмяРеквизитаВалютаУПР", ИмяРеквизитаВалютаУПР);
	СохраняемоеЗначение.Вставить("ИмяРеквизитаВалютаДокумента", ИмяРеквизитаВалютаДокумента);
	
	СохраняемоеЗначение.Вставить("ИмяРеквизитаРасшифровкаПлатежаСумма", ИмяРеквизитаРасшифровкаПлатежаСумма);
	СохраняемоеЗначение.Вставить("ПересчитатьСуммуНДСВРасшифровкеПлатежа", ПересчитатьСуммуНДСВРасшифровкеПлатежа);
	
    //СохраняемоеЗначение.Вставить("ИмяРегистраПроизводственногоКалендаря", ИмяРегистраПроизводственногоКалендаря);
    //СохраняемоеЗначение.Вставить("ИмяИзмеренияДатаПроизводственногоКалендаря", ИмяИзмеренияДатаПроизводственногоКалендаря);
	
	СохраняемоеЗначение.Вставить("ТипРегистраДенежныеСредства", ТипРегистраДенежныеСредства);
	
	СтруктураРегистраДенежныеСредства = Новый Структура;
	
	Если ТипРегистраДенежныеСредства = "РегистрНакопления" Тогда
		
		СтруктураРегистраДенежныеСредства.Вставить("КоличествоРегистровДенежныеСредства", КоличествоРегистровДенежныеСредства);
		
		Если КоличествоРегистровДенежныеСредства =2 Тогда
			
			СтруктураРегистраДенежныеСредства.Вставить("ИмяРегистраДенежныеСредстваНаличные", ИмяРегистраДенежныеСредстваНаличные);
			СтруктураРегистраДенежныеСредства.Вставить("ИмяРегистраДенежныеСредстваБезНаличные", ИмяРегистраДенежныеСредстваБезНаличные);
			СтруктураРегистраДенежныеСредства.Вставить("ИмяРесурсаСуммаУпрНаличные", ИмяРесурсаСуммаУпрНаличные);
			СтруктураРегистраДенежныеСредства.Вставить("ИмяРесурсаСуммаУпрБезНаличные", ИмяРесурсаСуммаУпрБезНаличные);
			
		ИначеЕсли КоличествоРегистровДенежныеСредства =1 Тогда
			
			СтруктураРегистраДенежныеСредства.Вставить("ИмяРегистраДенежныеСредства", ИмяРегистраДенежныеСредства);
			СтруктураРегистраДенежныеСредства.Вставить("ИмяИзмеренияТипДенежныхСредств", ИмяИзмеренияТипДенежныхСредств);
			СтруктураРегистраДенежныеСредства.Вставить("ИмяПеречисленияТипДенежныхСредств", ИмяПеречисленияТипДенежныхСредств);
			СтруктураРегистраДенежныеСредства.Вставить("ИмяРесурсаСуммаУпр", ИмяРесурсаСуммаУпр);
			
						 			
		КонецЕсли;
		
	иначе
		
		СтруктураРегистраДенежныеСредства.Вставить("ИмяРегистраБухгалтерии", ИмяРегистраБухгалтерии);
		
		Если ИмяРегистраБухгалтерии = "Хозрасчетный" Тогда
		
			СтруктураРегистраДенежныеСредства.Вставить("КодСчетаНаличные", "50");
			СтруктураРегистраДенежныеСредства.Вставить("КодСчетаБезНаличные", "51");
		
		КонецЕсли;
		
	КонецЕсли;
	
	СохраняемоеЗначение.Вставить("СтруктураРегистраДенежныеСредства", СтруктураРегистраДенежныеСредства);
	
	Хранилище = Новый ХранилищеЗначения(СохраняемоеЗначение);
	Константы.ИА_ФП_НастройкиРеквизитов.Установить(Хранилище);

КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиЗаполненияРеквизитовНаСервере()
	
	СтруктураНастроек = ИА_ФП_ПовторИсп.ПолучитьЗначениеКонстанты_ФП_НастройкиРеквизитов();
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура")  Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьНастройкиЗаполненияРеквизитовНаСервере(СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиЗаполненияРеквизитовНаСервере(СтруктураНастроек)
	
	Для каждого Настройка Из СтруктураНастроек Цикл
		                                                                             
		Если ТипЗнч(Настройка.Значение) = Тип("Структура") Тогда
			ЗаполнитьНастройкиЗаполненияРеквизитовНаСервере(Настройка.Значение);
		Иначе	 
			
			Попытка
				ЭтаФорма[Настройка.Ключ] = Настройка.Значение;
			Исключение
			
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьСпискиВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыНФЗаказНаПриобретение(Команда)
	ОткрытьФорму("РегистрСведений.ИА_НФ_ЗаказНаПриобретение.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ИА_ФП_РазделятьНалИБезналПриИзменении(Элемент)
	
	//Элементы.ИА_ФП_ИспользоватьВидДССправочно.Доступность = Не НаборКонстант.ИА_ФП_РазделятьНалИБезнал;
	
	Если НаборКонстант.ИА_ФП_РазделятьНалИБезнал Тогда
		НаборКонстант.ИА_ФП_ИспользоватьВидДССправочно =  Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Календарь(Команда)
    ОткрытьФорму("РегистрСведений.ИА_Календарь.ФормаСписка");
КонецПроцедуры


#КонецОбласти

#КонецОбласти

#Область НастройкиЗАполненияРеквизитовДляМП
&НаКлиенте
Процедура НастройкаОбменаСМобильнымПриложением(Команда)
	Форма = ПолучитьФорму("ОбщаяФорма.ИА_МП_НастройкиЗаполненияРеквизитов",,ЭтаФорма);	
	Форма.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ЛоготипКомпанииНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("ДобавитьИзображениеЗавершение", ЭтаФорма);
	НачатьПомещениеФайла(Оповещение,,, Истина, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображениеЗавершение(Результат, Адрес, ВыбранноеИмя, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		//Если ДополнительныеПараметры.Аватар Тогда 			
		//	ИА_КСУОбщийСервер.ОбновитьАватар(,,Адрес,АдресКартинкиАватар, уид2);
		//Иначе
		//	АдресКартинки = Адрес;
		//	Если Вопрос("Обновить аватар?",РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		//		ИА_КСУОбщийСервер.ОбновитьАватар(,,Адрес,АдресКартинкиАватар, уид2);
		//	КонецЕсли;
		//КонецЕсли;
		
		УстановитьЛоготип(адрес);
		
		АдресКартинкиЛоготип = Адрес;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЛоготип(адрес)
	ДД_Фото = ПолучитьИзВременногоХранилища(Адрес);
	Константы.ИА_ЛоготипКомпании.Установить(Новый ХранилищеЗначения(ДД_Фото));
КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСФайлами(Команда)
	Если Не ПодключитьРасширениеРаботыСФайлами() Тогда               
        НачатьУстановкуРасширенияРаботыСФайлами(Новый ОписаниеОповещения("РасширениеРаботыСФайламиЗавершение", ЭтотОбъект));       
    КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасширениеРаботыСФайламиЗавершение(ДополнительныеПараметры) Экспорт
	
	ПодключитьРасширениеРаботыСФайлами();

КонецПроцедуры

&НаСервере
Процедура ОчиститьШаблонДИНаСервере()
	Константы.ИА_ДИ_Шаблон.Установить( Новый ХранилищеЗначения(Неопределено));
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьШаблонДИ(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьШаблонДИЗавершение", ЭтотОбъект), "Вы уверены?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьШаблонДИЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да ТОгда
		ОчиститьШаблонДИНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОчиститьШаблонПодписиДИНаСервере()
	Константы.ИА_ДИ_ШаблонПодпись.Установить( Новый ХранилищеЗначения(Неопределено));
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьШаблонПодписиДИ(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьШаблонПодписиДИЗавершение", ЭтотОбъект), "Вы уверены?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьШаблонПодписиДИЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса=КодВозвратаДиалога.Да ТОгда
		ОчиститьШаблонПодписиДИНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИА_ДИ_ИспользоватьGoogleДокументыПриИзменении(Элемент)
	Если НаборКонстант.ИА_ДИ_ИспользоватьGoogleДокументы Тогда
		НаборКонстант.ИА_ДИ_ИспользоватьGoogleДокументыДляКонвертации = ложь;
	КонецЕсли;
	ВидимостьНастроекДИ();
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьНастроекДИ()
	гугл = НаборКонстант.ИА_ДИ_ИспользоватьGoogleДокументы;
	Элементы.ГруппаДИ_Обычн.Видимость = не  гугл;
	Элементы.ГруппаДИ_Гугл.Видимость = гугл или НаборКонстант.ИА_ДИ_ИспользоватьGoogleДокументыДляКонвертации;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПроектаКСУ()
	Возврат ИА_КСУОбщийСервер.ПолучитьДанныеПроектаКСУ();
КонецФункции
	
&НаКлиенте
Процедура ЗапроситьДоступGoogle(Команда)
	Элементы.Браузер.Видимость = истина;
	
	ДанныеПроекта = ПолучитьДанныеПроектаКСУ();
	//Параметры1 = "response_type=code&client_id=" + ДанныеПроекта.client_id + "&redirect_uri=http://localhost&access_type=offline&scope=https://www.googleapis.com/auth/drive";
	Параметры1 = "response_type=code&client_id=" + ДанныеПроекта.client_id + "&redirect_uri=urn:ietf:wg:oauth:2.0:oob:auto&access_type=offline&scope=https://www.googleapis.com/auth/drive https://www.googleapis.com/auth/documents";
	ПолныйАдресАвторизации = "https://accounts.google.com/o/oauth2/auth?" + Параметры1;
	Браузер = ПолныйАдресАвторизации;
КонецПроцедуры

&НаКлиенте
Процедура БраузерДокументСформирован(Элемент)
	тт = Элементы.Браузер.документ.title;
	
	ПозКода = найти(тт,"Success code=");
	Если ПозКода = 0 Тогда
		Возврат;
	КонецЕсли;

	КодДоступа = СтрЗаменить(тт, "Success code=",""); 
	
	//URL = Элементы.Браузер.документ.URLUnencoded;
	//
	//ПозКода = найти(URL,"?code=");
	//Если найти(URL,"?code=") = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//КодДоступа = сред(Элементы.Браузер.документ.URLUnencoded,ПозКода+6);
	ДанныеПроекта = ПолучитьДанныеПроектаКСУ();
	
	//ПараметрыPOST = "grant_type=authorization_code&code=" + КодДоступа + "&client_id=" + ДанныеПроекта.client_id + "&client_secret=" + ДанныеПроекта.client_secret + "&redirect_uri=http://localhost";	
	ПараметрыPOST = "grant_type=authorization_code&code=" + КодДоступа + "&client_id=" + ДанныеПроекта.client_id + "&client_secret=" + ДанныеПроекта.client_secret + "&redirect_uri=urn:ietf:wg:oauth:2.0:oob:auto";	
	хеадерс = новый Соответствие;
	хеадерс.Вставить("Content-Type","application/x-www-form-urlencoded");

	//Соединение = Новый HTTPСоединение("accounts.google.com", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL());	
	//Запрос = Новый HTTPЗапрос("/o/oauth2/token", хеадерс);    
	Соединение = Новый HTTPСоединение("www.googleapis.com", 443,,,,, Новый ЗащищенноеСоединениеOpenSSL()); 
	Запрос = Новый HTTPЗапрос("/oauth2/v4/token", хеадерс);

	Запрос.УстановитьТелоИзСтроки(ПараметрыPOST, КодировкаТекста.Системная);
    Результат = Соединение.ОтправитьДляОбработки(Запрос);
	ТекстОтвета = Результат.ПолучитьТелоКакСтроку();
	
	БраузерДокументСформированНаСервере(ТекстОтвета);
	
	//JSon = Новый ЧтениеJSON;
	//JSon.УстановитьСтроку(ТекстОтвета);
	//рез = ПрочитатьJSON(JSon);
	//
	//refresh_token = рез.refresh_token;
	//access_token = рез.access_token;
	//
	//УстановитьТокен(refresh_token);
	//Браузер = "<html><b>Доступ получен!</b></html>";
КонецПроцедуры

&НаСервере
Процедура БраузерДокументСформированНаСервере(ТекстОтвета)
	JSon = Новый ЧтениеJSON;
	JSon.УстановитьСтроку(ТекстОтвета);
	рез = ПрочитатьJSON(JSon);
	
	refresh_token = рез.refresh_token;
	access_token = рез.access_token;
	
	УстановитьТокен(refresh_token);
	Браузер = "<html><b>Доступ получен!</b></html>";
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьТокен(токен)
	Константы.ИА_ДИ_Токен.Установить(токен);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АктуализироватьВсеДокументыНаСервере()
	ИА_Инструкции.АктуализацияGoogle();
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьВсеДокументы(Команда)
	АктуализироватьВсеДокументыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИА_ДИ_ИспользоватьGoogleДокументыДляКонвертацииПриИзменении(Элемент)
	Если НаборКонстант.ИА_ДИ_ИспользоватьGoogleДокументыДляКонвертации Тогда
		НаборКонстант.ИА_ДИ_ИспользоватьGoogleДокументы = ложь;
	КонецЕсли;
	ВидимостьНастроекДИ();
КонецПроцедуры

&НаСервере
Процедура КСУ_ВидОргсхемыПриИзмененииНаСервере()
	Элементы.ИА_ВариантыОформленияДепартаментов.Доступность = НаборКонстант.КСУ_ВидОргсхемы <> Перечисления.КСУ_ВидОргсхемы.EM;	
	Если НаборКонстант.КСУ_ВидОргсхемы = Перечисления.КСУ_ВидОргсхемы.EM Тогда
		НаборКонстант.ИА_ВариантыОформленияДепартаментов = Перечисления.ИА_ВариантыОформленияДепартаментов.Отдельно;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КСУ_ВидОргсхемыПриИзменении(Элемент)
	КСУ_ВидОргсхемыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьРасписаниеРассылки()
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные",      Метаданные.РегламентныеЗадания.КСУ_Рассылка_РС_Владельца);
	Отбор.Вставить("Использование",   Истина);                               
	ФоновоеЗадание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	возврат ФоновоеЗадание[0].Расписание;
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьРаспианиеРассылки(расп)
	Отбор = Новый Структура;
	Отбор.Вставить("Метаданные",      Метаданные.РегламентныеЗадания.КСУ_Рассылка_РС_Владельца);
	Отбор.Вставить("Использование",   Истина);                               
	ФоновоеЗадание = РегламентныеЗадания.ПолучитьРегламентныеЗадания(Отбор);
	ф = ФоновоеЗадание[0];
	ф.расписание = расп;
	ф.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ДекРасписаниеНажатие(Элемент)
	
	Попытка
		расп = ПолучитьРасписаниеРассылки();
			
		Диалог = Новый ДиалогРасписанияРегламентногоЗадания(расп);  		
		Диалог.Показать(Новый ОписаниеОповещения("ДекРасписаниеНажатиеЗавершение", ЭтотОбъект));		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ДекРасписаниеНажатиеЗавершение(Расписание11, ДополнительныеПараметры) Экспорт
		
	Если Расписание11<>Неопределено Тогда
		УстановитьРаспианиеРассылки(Расписание11);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НастройкиВебСистемы(Команда)
	ОткрытьФорму("ОбщаяФорма.КСУ_НастройкиВеб");
КонецПроцедуры

&НаКлиенте
Процедура КСУ_КЦ_ИспользоватьВзаимодействия1СПриИзменении(Элемент)
	Если НаборКонстант.КСУ_КЦ_ИспользоватьВзаимодействия1С Тогда
		Если НЕ СистемаВзаимодействия.ИспользованиеДоступно() Тогда
			ПоказатьПредупреждение(,"База не зарегистрирована в системе взаимодействий! Обратитесь к администратору");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КСУ_ФП_ИспользоватьПодразделенияПриИзменении(Элемент)
	Если НаборКонстант.КСУ_ФП_ИспользоватьПодразделения <> ЗначениеВедениеПОподр() Тогда
		ОпОп = новый ОписаниеОповещения("ВыборВопросПодр", ЭтотОбъект);
		СтрокаСообщ = "Внимание! 
                       |
                       |Изменение режима ведения учета по подразделениям 
					   |повлияет на корректность работы ФП. Могут быть 
					   |искажены остатки по фондам, резервам, неверно 
					   |работать уже настроенные точки безубыточности.
                       |
                       |Проконсультируйтесь со специалистом 
					   |компании Инсайт 
					   |(тел. 8-495-9894340). 
                       |
                       |Отменить изменение?";
		ПоказатьВопрос(ОпОп, СтрокаСообщ, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбновитьДоступностьДоходыПоПодр();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборВопросПодр(выбзн, дп) экспорт
	Если выбзн = КодВозвратаДиалога.Да тогда
		НаборКонстант.КСУ_ФП_ИспользоватьПодразделения = ЗначениеВедениеПОподр();
	КонецЕсли;
		
	ОбновитьДоступностьДоходыПоПодр();
КонецПроцедуры
	
&НаСервереБезКонтекста
Функция ЗначениеВедениеПОподр()
	возврат Константы.КСУ_ФП_ИспользоватьПодразделения.Получить();
КонецФункции

&НаКлиенте
Процедура ОбновитьДоступностьДоходыПоПодр()
	Элементы.КСУ_ДоходыПоПодразделениям.Доступность = НаборКонстант.КСУ_ФП_ИспользоватьПодразделения  ;
	Если не Элементы.КСУ_ДоходыПоПодразделениям.Доступность и НаборКонстант.КСУ_ДоходыПоПодразделениям Тогда
		НаборКонстант.КСУ_ДоходыПоПодразделениям = ложь;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СнятьБлокировкуПолей(Команда)
	ПоляЗаблокированы = Ложь;
	ОбновитьБлокПолей();
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьПоля(Команда)
	ПоляЗаблокированы = Истина;
	ОбновитьБлокПолей();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьБлокПолей()
	Элементы.ГруппаРекв.ТолькоПросмотр = ПоляЗаблокированы;
	Элементы.ГруппаЗаполнитьПоШаблону.Видимость = не ПоляЗаблокированы;
	Элементы.ЗаблокироватьПоля.Видимость = не ПоляЗаблокированы;
	Элементы.СнятьБлокировкуПолей.Видимость = ПоляЗаблокированы;
КонецПроцедуры


#КонецОбласти
